Revit 2024 API
AnalyticalBusData Properties
The AnalyticalBusData type exposes the following members.
Properties
Name | Description
CurrentRating
 The current rating value of the analytical bus.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from AnalyticalDistributionNodePropertyData.)
NumberOfPhases
 The number of phases.
 (Inherited from AnalyticalDistributionNodePropertyData.)
TotalConnectedCurrent
 The total connected current of the analytical bus.
Voltage
 The voltage value of the analytical bus.
See Also
AnalyticalBusData Class
Autodesk.Revit.DB.Electrical Namespace